import pandas as pd

# Завантажуємо датафрейм 
df = pd.read_csv('m3/u1/GoogleApps.csv')


# Як називається програма, розташована першим у наборі даних?

#print(df)
#print(df.info())

# До якої категорії відноситься додаток, розташований останнім у наборі даних?

#print(df.head())
#print(df.tail())
print(df.describe())
# Скільки стовпців міститься у наборі даних?
# Дані якого типу зберігаються у кожному зі стовпців?


# Вкажіть середнє арифметичне та медіану розміру додатків (Size)
# Скільки коштує найдорожчий додаток?
# *Вкажіть середнє арифметичне та медіану кількості установок програм (Installs)
